uliano/brio/brio/ch32v203/device.hpp
/// PLLMUL codes. The ladder is x2..x16 in order and then x18 - the one
/// code that is not its own index plus two, and the one that reaches
/// this family's ceiling from the 8 MHz HSI (3.4.2, CH32V20x_D6/D8).
inline constexpr uint32_t rcc_pllmul_code(uint32_t mul) {
    return mul == 18 ? 0xFUL : (mul - 2);
}
inline constexpr uint32_t rcc_pllmul_of(uint32_t code) {
    return code == 0xF ? 18UL : (code + 2);
}

/// RCC_INTR (3.4.3): the ready flags, their enables, the write-one clears.
inline constexpr uint32_t rcc_lsirdyf  = 1UL << 0;
inline constexpr uint32_t rcc_lserdyf  = 1UL << 1;
inline constexpr uint32_t rcc_hsirdyf  = 1UL << 2;
inline constexpr uint32_t rcc_hserdyf  = 1UL << 3;
inline constexpr uint32_t rcc_pllrdyf  = 1UL << 4;
inline constexpr uint32_t rcc_cssf     = 1UL << 7;
inline constexpr uint32_t rcc_lsirdyie = 1UL << 8;
inline constexpr uint32_t rcc_lserdyie = 1UL << 9;
inline constexpr uint32_t rcc_hsirdyie = 1UL << 10;
inline constexpr uint32_t rcc_hserdyie = 1UL << 11;
inline constexpr uint32_t rcc_pllrdyie = 1UL << 12;
inline constexpr uint32_t rcc_lsirdyc  = 1UL << 16;
inline constexpr uint32_t rcc_lserdyc  = 1UL << 17;
inline constexpr uint32_t rcc_hsirdyc  = 1UL << 18;
inline constexpr uint32_t rcc_hserdyc  = 1UL << 19;
inline constexpr uint32_t rcc_pllrdyc  = 1UL << 20;
inline constexpr uint32_t rcc_cssc     = 1UL << 23;
/// The enables as one field. The flags are read-only and the clears
/// write-only, so a verb that clears one flag writes
/// (INTR & rcc_intr_enables) | <the clear bit> and disarms nothing.
inline constexpr uint32_t rcc_intr_enables = rcc_lsirdyie | rcc_lserdyie | rcc_hsirdyie |
                                             rcc_hserdyie | rcc_pllrdyie;
inline constexpr uint32_t rcc_intr_flags   = rcc_lsirdyf | rcc_lserdyf | rcc_hsirdyf |
                                             rcc_hserdyf | rcc_pllrdyf | rcc_cssf;

/// RCC_RSTSCKR (3.4.10): the LSI lives with the reset flags.
inline constexpr uint32_t rcc_lsion  = 1UL << 0;
inline constexpr uint32_t rcc_lsirdy = 1UL << 1;

/// RCC_HBPCENR (3.4.6)
inline constexpr uint32_t rcc_hb_dma1  = 1UL << 0;
inline constexpr uint32_t rcc_hb_dma2  = 1UL << 1;    ///< not on this family's parts
inline constexpr uint32_t rcc_hb_sram  = 1UL << 2;
inline constexpr uint32_t rcc_hb_crc   = 1UL << 6;
inline constexpr uint32_t rcc_hb_usbfs = 1UL << 12;   ///< the host/device controller

/// RCC_PB2PCENR (3.4.7): one bit per peripheral on the PB2 bus.
inline constexpr uint32_t rcc_pb2_afio   = 1UL << 0;
inline constexpr uint32_t rcc_pb2_gpioa  = 1UL << 2;
inline constexpr uint32_t rcc_pb2_gpiob  = 1UL << 3;
inline constexpr uint32_t rcc_pb2_gpioc  = 1UL << 4;
inline constexpr uint32_t rcc_pb2_gpiod  = 1UL << 5;
inline constexpr uint32_t rcc_pb2_gpioe  = 1UL << 6;
inline constexpr uint32_t rcc_pb2_adc1   = 1UL << 9;
inline constexpr uint32_t rcc_pb2_adc2   = 1UL << 10;
inline constexpr uint32_t rcc_pb2_tim1   = 1UL << 11;
inline constexpr uint32_t rcc_pb2_spi1   = 1UL << 12;
inline constexpr uint32_t rcc_pb2_usart1 = 1UL << 14;

/// RCC_PB1PCENR (3.4.8). PWR and BKP are two of them: their registers
/// answer rubbish until their gates are open.
inline constexpr uint32_t rcc_pb1_tim2   = 1UL << 0;
inline constexpr uint32_t rcc_pb1_tim3   = 1UL << 1;
inline constexpr uint32_t rcc_pb1_tim4   = 1UL << 2;
inline constexpr uint32_t rcc_pb1_tim5   = 1UL << 3;    ///< the CH32V203RB's alone (device::has_tim5)
inline constexpr uint32_t rcc_pb1_wwdg   = 1UL << 11;
inline constexpr uint32_t rcc_pb1_spi2   = 1UL << 14;
inline constexpr uint32_t rcc_pb1_usart2 = 1UL << 17;
inline constexpr uint32_t rcc_pb1_usart3 = 1UL << 18;
inline constexpr uint32_t rcc_pb1_uart4  = 1UL << 19;
inline constexpr uint32_t rcc_pb1_i2c1   = 1UL << 21;
inline constexpr uint32_t rcc_pb1_i2c2   = 1UL << 22;
inline constexpr uint32_t rcc_pb1_usbd   = 1UL << 23;   ///< the full-speed device controller
inline constexpr uint32_t rcc_pb1_can1   = 1UL << 25;
inline constexpr uint32_t rcc_pb1_bkp    = 1UL << 27;
inline constexpr uint32_t rcc_pb1_pwr    = 1UL << 28;

// ---- GPIO (RM ch. 10) -----------------------------------------------------
// The F1 shape whole: sixteen pins a port, four configuration bits each
// (CNF above MODE) split over two registers.
struct GpioRegs {
    volatile uint32_t CFGLR;      ///< 0x00 pins 0..7, four bits each
    volatile uint32_t CFGHR;      ///< 0x04 pins 8..15
    volatile uint32_t INDR;       ///< 0x08 input data
    volatile uint32_t OUTDR;      ///< 0x0c output data (and the pull's direction)
    volatile uint32_t BSHR;       ///< 0x10 set (low half) / reset (high half)
    volatile uint32_t BCR;        ///< 0x14 reset
    volatile uint32_t LCKR;       ///< 0x18 configuration lock
};

/// The ports this family addresses, in letter order. Which of them a
/// PART bonds, and which pins of each, is the part's own table
/// (device::port_pins) - the block answers either way.
inline constexpr uint32_t gpio_base_for(char port) {
    return port == 'A' ? pb2_base + 0x0800 :
           port == 'B' ? pb2_base + 0x0c00 :
           port == 'C' ? pb2_base + 0x1000 :
           port == 'D' ? pb2_base + 0x1400 :
           port == 'E' ? pb2_base + 0x1800 : 0;
}

inline constexpr uint32_t gpio_clock_for(char port) {
    return port == 'A' ? rcc_pb2_gpioa :
           port == 'B' ? rcc_pb2_gpiob :
           port == 'C' ? rcc_pb2_gpioc :
           port == 'D' ? rcc_pb2_gpiod :
           port == 'E' ? rcc_pb2_gpioe : 0;
}

// ---- AFIO (RM 10.2) -------------------------------------------------------
struct AfioRegs {
    volatile uint32_t ECR;        ///< 0x00 the event output
    volatile uint32_t PCFR1;      ///< 0x04 the remaps
    volatile uint32_t EXTICR[4];  ///< 0x08 which port feeds each EXTI line
    uint32_t RESERVED0;           ///< 0x18
    volatile uint32_t PCFR2;      ///< 0x1c the second remap register
};

inline AfioRegs* afio() { return reinterpret_cast<AfioRegs*>(pb2_base + 0x0000); }

// ---- USART (RM ch. 18) ----------------------------------------------------
// Sixteen-bit registers on word-aligned addresses, the F1 shape. The
// chapter's CTLR4 (MARK and SPACE parity) belongs to the CH32F20x_D8 and
// the CH32V30x and is not part of this family's register file.
struct UsartRegs {
    volatile uint16_t STATR;  uint16_t RESERVED0;   ///< 0x00
    volatile uint16_t DATAR;  uint16_t RESERVED1;   ///< 0x04
    volatile uint16_t BRR;    uint16_t RESERVED2;   ///< 0x08
    volatile uint16_t CTLR1;  uint16_t RESERVED3;   ///< 0x0c
    volatile uint16_t CTLR2;  uint16_t RESERVED4;   ///< 0x10
    volatile uint16_t CTLR3;  uint16_t RESERVED5;   ///< 0x14
    volatile uint16_t GPR;    uint16_t RESERVED6;   ///< 0x18
};

/// The instances this family addresses. USART1 is the PB2 one and runs
/// at PCLK2; the other three are PB1's. WHICH of them a PART offers is
/// its own table (device::has_usart), and on the smallest part that is
/// not the first n of them.
inline constexpr uint32_t usart_base_for(int n) {
    return n == 1 ? pb2_base + 0x3800 :
           n == 2 ? pb1_base + 0x4400 :
           n == 3 ? pb1_base + 0x4800 :
           n == 4 ? pb1_base + 0x4c00 : 0;
}

/// USART_STATR (18.10.1). PE, FE, NE, ORE and IDLE are read-only and
/// cleared by the STATR-then-DATAR read sequence; RXNE is cleared by a
/// DATAR read and TXE by a DATAR write; RXNE, TC, LBD and CTS are also
/// write-zero-to-clear (`usart_statr_rw0`).
inline constexpr uint16_t usart_pe   = 1U << 0;
inline constexpr uint16_t usart_fe   = 1U << 1;
inline constexpr uint16_t usart_ne   = 1U << 2;
inline constexpr uint16_t usart_ore  = 1U << 3;
inline constexpr uint16_t usart_idle = 1U << 4;
inline constexpr uint16_t usart_rxne = 1U << 5;
inline constexpr uint16_t usart_tc   = 1U << 6;
inline constexpr uint16_t usart_txe  = 1U << 7;
inline constexpr uint16_t usart_lbd  = 1U << 8;
inline constexpr uint16_t usart_cts  = 1U << 9;
inline constexpr uint16_t usart_statr_rw0 = usart_rxne | usart_tc | usart_lbd | usart_cts;

/// USART_CTLR1 (18.10.4)
inline constexpr uint16_t usart_sbk    = 1U << 0;    ///< send a break (self-clearing)
inline constexpr uint16_t usart_rwu    = 1U << 1;    ///< receiver in mute
inline constexpr uint16_t usart_re     = 1U << 2;
inline constexpr uint16_t usart_te     = 1U << 3;
inline constexpr uint16_t usart_idleie = 1U << 4;
inline constexpr uint16_t usart_rxneie = 1U << 5;
inline constexpr uint16_t usart_tcie   = 1U << 6;
inline constexpr uint16_t usart_txeie  = 1U << 7;
inline constexpr uint16_t usart_peie   = 1U << 8;
inline constexpr uint16_t usart_ps     = 1U << 9;    ///< 1: odd parity
inline constexpr uint16_t usart_pce    = 1U << 10;
inline constexpr uint16_t usart_wake   = 1U << 11;   ///< 1: address mark wakes, 0: idle line
inline constexpr uint16_t usart_m      = 1U << 12;   ///< 1: 9-bit word
inline constexpr uint16_t usart_ue     = 1U << 13;

/// USART_CTLR2 (18.10.5)
inline constexpr uint16_t usart_add_mask   = 0xFU << 0;   ///< the mute address, 4 bits
inline constexpr uint16_t usart_lbdl       = 1U << 5;     ///< 1: 11-bit break detection, 0: 10
inline constexpr uint16_t usart_lbdie      = 1U << 6;
inline constexpr uint16_t usart_lbcl       = 1U << 8;     ///< the clock pulse of the last data bit too
inline constexpr uint16_t usart_cpha       = 1U << 9;     ///< 1: capture on the second edge
inline constexpr uint16_t usart_cpol       = 1U << 10;    ///< 1: CK idles high
inline constexpr uint16_t usart_clken      = 1U << 11;    ///< the CK pad driven
inline constexpr uint16_t usart_stop_mask  = 0x3U << 12;  ///< 00 one, 01 half, 10 two, 11 one and a half
inline constexpr uint16_t usart_stop_shift = 12;
inline constexpr uint16_t usart_linen      = 1U << 14;

/// USART_CTLR3 (18.10.6)
inline constexpr uint16_t usart_eie    = 1U << 0;    ///< FE/ORE/NE interrupt, under DMAR
inline constexpr uint16_t usart_iren   = 1U << 1;
inline constexpr uint16_t usart_irlp   = 1U << 2;
inline constexpr uint16_t usart_hdsel  = 1U << 3;
inline constexpr uint16_t usart_nack   = 1U << 4;    ///< smartcard
inline constexpr uint16_t usart_scen   = 1U << 5;
inline constexpr uint16_t usart_dmar   = 1U << 6;
inline constexpr uint16_t usart_dmat   = 1U << 7;
inline constexpr uint16_t usart_rtse   = 1U << 8;
inline constexpr uint16_t usart_ctse   = 1U << 9;
inline constexpr uint16_t usart_ctsie  = 1U << 10;

/// USART_GPR (18.10.7): the IrDA prescaler, and the smartcard's guard
/// time above it.
inline constexpr uint16_t usart_psc_mask = 0x00FFU;
inline constexpr uint16_t usart_gt_mask  = 0xFF00U;

// ---- FLASH (RM ch. 32) ----------------------------------------------------
// The engine, for the chapter that will use it. There is no wait-state
// field on this family: the array is split into a zero-wait and a
// non-zero-wait region by the part, and CTLR's SCKMOD chooses whether
// the flash is accessed at the system clock or at half of it.
struct FlashRegs {
    volatile uint32_t ACTLR;         ///< 0x00
    volatile uint32_t KEYR;          ///< 0x04 the FPEC unlock keys (write-only)
    volatile uint32_t OBKEYR;        ///< 0x08 the option-byte unlock keys (write-only)
    volatile uint32_t STATR;         ///< 0x0c BSY, WRPRTERR, EOP
    volatile uint32_t CTLR;          ///< 0x10 PG, PER, MER, OBER, STRT, LOCK, the fast page verbs
    volatile uint32_t ADDR;          ///< 0x14 the page to program or erase
    uint32_t RESERVED0;              ///< 0x18
    volatile uint32_t OBR;           ///< 0x1c the option bytes as loaded
    volatile uint32_t WPR;           ///< 0x20 write protection, one bit per 4 KB
    volatile uint32_t MODEKEYR;      ///< 0x24 the fast-programming unlock keys (write-only)
};

inline FlashRegs* flash_ctl() { return reinterpret_cast<FlashRegs*>(hb_base + 0x2000); }

/// The two keys, written in this order and consecutively to KEYR (the
/// FPEC lock) and to MODEKEYR (the fast-programming lock).
inline constexpr uint32_t flash_key1 = 0x45670123UL;
inline constexpr uint32_t flash_key2 = 0xCDEF89ABUL;

/// The flash as the core reads it: the array answers at its own address
/// and at the alias the core boots from, and the image is linked at the
/// alias (ld/<part>.ld).
inline constexpr uint32_t flash_array_base = 0x08000000UL;
inline constexpr uint32_t flash_alias_base = 0x00000000UL;

// ---- ESIG (RM ch. 31) -----------------------------------------------------
/// What the factory wrote about this die: the flash capacity in
/// kilobytes and the 96-bit unique identifier.
inline uint16_t esig_flash_kbytes() {
    return *reinterpret_cast<volatile const uint16_t*>(0x1FFFF7E0UL);
}
inline uint32_t esig_uid_word(int n) {
    return *reinterpret_cast<volatile const uint32_t*>(0x1FFFF7E8UL + 4UL * static_cast<uint32_t>(n));
}

