uliano/brio/brio/ch32v203/device.hpp
// ---- EXTEN (RM ch. 33) ----------------------------------------------------
/// One register on the HB bus, reset only by a system reset, holding
/// what did not fit anywhere else - and one thing that matters to the
/// clock tree: HSIPRE, which says whether the PLL is fed the HSI or half
/// of it. The PLL's own source bit is RCC's; its divider is here.
struct ExtenRegs {
    volatile uint32_t CTR;        ///< 0x00 EXTEN_CTR, reset 0x00000A40
    uint32_t RESERVED0;           ///< 0x04
    volatile uint32_t CTR2;       ///< 0x08
};

inline ExtenRegs* exten() { return reinterpret_cast<ExtenRegs*>(hb_base + 0x3800); }

inline constexpr uint32_t exten_usbd_ls        = 1UL << 0;   ///< the device controller in low speed
inline constexpr uint32_t exten_usbd_pullup    = 1UL << 1;   ///< its internal 1.5k on D+
inline constexpr uint32_t exten_eth_10m        = 1UL << 2;   ///< CH32V203RB alone
inline constexpr uint32_t exten_hsipre         = 1UL << 4;   ///< 1: the HSI whole into the PLL, 0: halved
inline constexpr uint32_t exten_hseplp        = 1UL << 12;  ///< the HSE kept oscillating in a low-power mode (D8 class)
inline constexpr uint32_t exten_lkupen         = 1UL << 6;   ///< the lock-up monitor, ON at reset
inline constexpr uint32_t exten_lkuprst        = 1UL << 7;   ///< write-1-clear: keep it out of a read-modify-write
inline constexpr uint32_t exten_ulldotrim_mask = 0x3UL << 8;
inline constexpr uint32_t exten_ldotrim_mask   = 0x3UL << 10;  ///< the core voltage, 10b = 1.1 V at reset

// ---- the core's own two blocks (QingKe V4 manual ch. 3 and 5) -------------
/// The system timer, which on this core is SIXTY-FOUR bits wide in two
/// register pairs - where the CH32V00x's V2C has one 32-bit counter and
/// one compare. Same block, same address, a different shape.
struct StkRegs {
    volatile uint32_t CTLR;       ///< 0xE000F000 SWIE, INIT, MODE, STRE, STCLK, STIE, STE
    volatile uint32_t SR;         ///< 0xE000F004 CNTIF (write 0 to clear)
    volatile uint32_t CNTL;       ///< 0xE000F008 the counter, low half
    volatile uint32_t CNTH;       ///< 0xE000F00c and high
    volatile uint32_t CMPLR;      ///< 0xE000F010 the comparison value, low half
    volatile uint32_t CMPHR;      ///< 0xE000F014 and high
};

inline StkRegs* stk() { return reinterpret_cast<StkRegs*>(0xE000F000UL); }

inline constexpr uint32_t stk_ste   = 1UL << 0;
inline constexpr uint32_t stk_stie  = 1UL << 1;
inline constexpr uint32_t stk_stclk = 1UL << 2;   ///< 1: HCLK, 0: HCLK/8
inline constexpr uint32_t stk_stre  = 1UL << 3;   ///< count again from 0 at the compare
inline constexpr uint32_t stk_mode  = 1UL << 4;   ///< 1: count down
inline constexpr uint32_t stk_init  = 1UL << 5;   ///< write-one: load the counter's initial value
inline constexpr uint32_t stk_swie  = 1UL << 31;  ///< raise the software interrupt
inline constexpr uint32_t stk_cntif = 1UL << 0;   ///< in SR, write 0 to clear

/// The interrupt controller (QingKe V4 manual 3.1). Mind the names: the
/// manual's ISR is the ENABLE status and its IPR the PENDING status -
/// the opposite of what the letters suggest.
struct PficRegs {
    volatile uint32_t ISR[8];     ///< 0x000 ENABLE status, read-only
    volatile uint32_t IPR[8];     ///< 0x020 PENDING status, read-only
    volatile uint32_t ITHRESDR;   ///< 0x040 priority threshold
    uint32_t RESERVED0;           ///< 0x044
    volatile uint32_t CFGR;       ///< 0x048
    volatile uint32_t GISR;       ///< 0x04c global status
    uint8_t RESERVED1[0x10];      ///< 0x050
    volatile uint32_t VTFADDRR[4];///< 0x060 the four free vectored entries
    uint8_t RESERVED2[0x90];      ///< 0x070
    volatile uint32_t IENR[8];    ///< 0x100 write 1 to ENABLE a line
    uint8_t RESERVED3[0x60];
    volatile uint32_t IRER[8];    ///< 0x180 write 1 to DISABLE a line
    uint8_t RESERVED4[0x60];
    volatile uint32_t IPSR[8];    ///< 0x200 write 1 to SET a line pending
    uint8_t RESERVED5[0x60];
    volatile uint32_t IPRR[8];    ///< 0x280 write 1 to CLEAR a pending line
    uint8_t RESERVED6[0x60];
    volatile uint32_t IACTR[8];   ///< 0x300 active (being serviced), read-only
    uint8_t RESERVED7[0xE0];
    volatile uint8_t IPRIOR[64];  ///< 0x400 one priority byte per line
};

inline PficRegs* pfic() { return reinterpret_cast<PficRegs*>(0xE000E000UL); }

/// PFIC_SCTLR, apart from the block: what a WFI means on this core.
inline volatile uint32_t& pfic_sctlr() {
    return *reinterpret_cast<volatile uint32_t*>(0xE000ED10UL);
}

inline constexpr uint32_t sctlr_sleeponexit = 1UL << 1;
inline constexpr uint32_t sctlr_sleepdeep   = 1UL << 2;
inline constexpr uint32_t sctlr_wfitowfe    = 1UL << 3;   ///< the NEXT wfi acts as a WFE
inline constexpr uint32_t sctlr_sevonpend   = 1UL << 4;   ///< any interrupt turning pending is a wake event
inline constexpr uint32_t sctlr_setevent    = 1UL << 5;   ///< write-one: latch an event by hand

/// Interrupt numbers, which on this core ARE the vector table's word
/// indices (QingKe V4 manual 3.2): the word at address 0 is an
/// instruction, the words after it are handler addresses. The tail from
/// 59 up is the DEVICE CLASS's, not the family's - the reference
/// manual's own table 9-2 is the union of this family with the CH32V30x
/// and names that range after the larger one's TIM8 (see
/// ch32v203/src/glue/startup_ch32v203.S). Two of the lines below
/// therefore MOVE with the class: on the CH32V20x_D8 the Ethernet pair
/// and two reserved words sit between the USBFS pair and them, so UART4
/// is 66 and the eighth DMA channel 67. The D8's own extra lines (the
/// Ethernet pair, TIM5 and the 32 kHz oscillator's two) are named here
/// when a driver of this stratum arms one.
enum class Irq : uint8_t {
    non_maskable     = 2,
    exception        = 3,
    ecall_machine    = 5,
    ecall_user       = 8,
    breakpoint       = 9,
    systick          = 12,
    software         = 14,
    wwdg             = 16,
    pvd              = 17,
    tamper           = 18,
    rtc              = 19,
    flash            = 20,
    rcc              = 21,
    exti0            = 22,
    exti1            = 23,
    exti2            = 24,
    exti3            = 25,
    exti4            = 26,
    dma1_channel1    = 27,
    dma1_channel2    = 28,
    dma1_channel3    = 29,
    dma1_channel4    = 30,
    dma1_channel5    = 31,
    dma1_channel6    = 32,
    dma1_channel7    = 33,
    adc1_2           = 34,
    usb_hp_can1_tx   = 35,
    usb_lp_can1_rx0  = 36,
    can1_rx1         = 37,
    can1_sce         = 38,
    exti9_5          = 39,
    tim1_brk         = 40,
    tim1_up          = 41,
    tim1_trg_com     = 42,
    tim1_cc          = 43,
    tim2             = 44,
    tim3             = 45,
    tim4             = 46,
    i2c1_ev          = 47,
    i2c1_er          = 48,
    i2c2_ev          = 49,
    i2c2_er          = 50,
    spi1             = 51,
    spi2             = 52,
    usart1           = 53,
    usart2           = 54,
    usart3           = 55,
    exti15_10        = 56,
    rtc_alarm        = 57,
    usb_wakeup       = 58,
    usbfs            = 59,   ///< the tail proper starts here (device::vector_count)
    usbfs_wakeup     = 60,
    uart4            = device::is_d8_class ? 66 : 61,
    dma1_channel8    = device::is_d8_class ? 67 : 62,
};

} // namespace brio
